/*
 * TODO list
 * (change, submit, preventDefault, form.elements, form.reset())

* Є форма з одним інпутом, куди вводиться текст. І є чекбокс.
 * 1) Поки чекбокс не натиснутий, кнопка на формі неактивна.
 * 2) Натисканням Enter в інпуті або натисканням на кнопку Add, в список нижче, додається todo.
 * 3) Прибрати перезавантаження, звертатися через форму (elements) та ім'я інпуту
 * 4) Очистити інпут та чекбокс
 * 5) При натисканні на todo-замітку у списку, вона стає виконаною, тобто текст закреслюється (клас complete)
 * 6) При додаванні нотатки кнопка повинна знову стати недоступною
 * 7) Створення todo винести в окрему функцію
 */
