/*
 * 4 способи повісити слухача події:
 * - в HTML на сам тег, прописуючи код у лапках (onclick="console.log('Button was clicked')") - погано
 * - в HTML на сам тег, викликаючи функція-обробник з js файлу(onclick="handleClick()"), працює на файлах без модуля - погано
 * - в js через властивість (button.onclick) - не можна додати два або більше слухача
 * - в js через addEventListener - найкращий варіант
 */

///////////////////////////////////////////////////////////////

/*
 * Popup
 * Є прихований popup з класом popup.
 * При натисканні на кнопку показати popup (клас popup_open).
 * При натисканні на ESC приховати.
 * Слухач ESC не повинен постійно висіти на window, а кнопка та слухач кліка повинні не діяти при відкритій модалці.
 */
